// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

// 456 -> 5
// 782 -> 8
// 918 -> 1

// {
// int second =  num / 10;
// int third = num % 10;
// int answer = second - third;
// return answer;
// }


// Console.WriteLine("Введите трёхзначное число: ");
// int number = Convert.ToInt32(Console.ReadLine());
// if (number >= 100 && number <= 999)
// {


// }



// // Console.WriteLine($"Вторая цифра числа {number} {CenterDigit}");

// int CenterDigit = (string num)


