// Напишите программу, которая на вход принимает натуральное число N, 
// а на выходе показывает его цифры через запятую.

Console.WriteLine("Введите натуральное число: ");
int N = Convert.ToInt32(Console.ReadLine());
